Саракташ2/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>Анонимный</name>
      <description>Анонимный</description>
    </items>
  </predefined>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Розница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <comment>ОГРН для неиностранных контрагентов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочтенияВИзделиях</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТранспортнаяКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоТелефону</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресуЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>АдресЮридический</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ПочтовыйИндекс</name>
  </enumValues>
  <enumValues>
    <name>Отправитель</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Телефоны = Новый Массив;
	АдресаЭП = Новый Массив;
	Адреса = Новый Массив;
	Для Каждого Стр Из КонтактнаяИнформация Цикл
		Если Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Телефоны.Добавить(Стр.Представление);
		ИначеЕсли Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			АдресаЭП.Добавить(Стр.Представление);
		ИначеЕсли Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес ИЛИ Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЮридический Тогда
			Адреса.Добавить(Стр.Представление);
		КонецЕсли;		
	КонецЦикла;
	
	Если Телефоны.Количество()>0 Тогда
		ПоискПоТелефону = СтрСоединить(Телефоны,";");
	Иначе
		ПоискПоТелефону = "";
	КонецЕсли;
	
	Если АдресаЭП.Количество()>0 Тогда
		ПоискПоАдресуЭлектроннойПочты = СтрСоединить(АдресаЭП,";");
	Иначе
		ПоискПоАдресуЭлектроннойПочты = "";
	КонецЕсли;
	
	Если Адреса.Количество()>0 Тогда
		ПоискПоАдресам = СтрСоединить(Адреса,";");
	Иначе
		ПоискПоАдресам = "";
	КонецЕсли;
	
	инд = КонтактнаяИнформация.Количество()-1;
	Пока инд >= 0 Цикл
		ТекСтрока = КонтактнаяИнформация[инд];
		Если ТекСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
			И Не ПустаяСтрока(ТекСтрока.Представление) Тогда
			ОсновнойАдрес = ТекСтрока.Представление;
			Прервать;
		КонецЕсли;
		инд = инд-1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		
		Выб = ПланыОбмена.ОбменССайтом.Выбрать();
		Пока Выб.Следующий() Цикл
			
			Если Выб.ЭтотУзел Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выб.ПометкаУдаления
				ИЛИ НЕ Выб.Активен 
				ИЛИ НЕ Выб.ВыгружатьПользователей Тогда
				Продолжить;
			КонецЕсли;
			
			//Контрагенты
			ПланыОбмена.ЗарегистрироватьИзменения(Выб.Ссылка,Ссылка);			
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
